case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
);

application simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
//Author
    //Ehsan Golab, SUT. All rights reserved.

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
{
    pressureDrop
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        enabled			true;
        outputControl		outputTime;//timeStep;
        redirectType		postProcess;

        codeInclude
        #{
            #include "fvCFD.H"
            #include "singlePhaseTransportModel.H"
            #include "RASModel.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/turbulenceModels \
            -I$(LIB_SRC)/turbulenceModels/incompressible/RAS/RASModel \
            -I$(LIB_SRC)/transportModels \
            -I$(LIB_SRC)/transportModels/incompressible/singlePhaseTransportModel \
            -I$(LIB_SRC)/finiteVolume/lnInclude
        #};

        codeLibs
        #{
            -lincompressibleRASModels \
            -lincompressibleTransportModels \
            -lincompressibleTurbulenceModel \
            -lfiniteVolume \
            -llduSolvers
        #};

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt", std::ofstream::app);


            //- lookup fields
            const volScalarField& p = mesh().lookupObject<volScalarField>("p");
            const volVectorField& U = mesh().lookupObject<volVectorField>("U");
            const surfaceScalarField& phi = mesh().lookupObject<surfaceScalarField>("phi");


            //- lookup rho
            singlePhaseTransportModel laminarTransport(U, phi);
            dimensionedScalar rho(laminarTransport.lookup("rho"));


            //- calculate pressure difference
            label inletID_ = p.mesh().boundaryMesh().findPatchID("inlet");
            scalar deltaP = rho.value()*sum(p.boundaryField()[inletID_]*p.mesh().magSf().boundaryField()[inletID_])/sum(p.mesh().magSf().boundaryField()[inletID_]);
            Info << "deltaP = " << deltaP << "\n";


            //- save data
            output << deltaP << "\n";
        #};
    }
}

// ************************************************************************* //
